Revit 2027 API
Transform1D.Assign Method
 Assigns values from the input transformation to this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	Transform1D from
)
Public Sub Assign (
	from As Transform1D
)
public:
void Assign(
	Transform1D^ from
)
member Assign :
        from : Transform1D -> unit
Parameters
from Transform1D
 The transformation to use as input.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
Transform1D Class
Autodesk.Revit.DB Namespace